const emojiKeywords: [string, string[]][] = [
	['🍇', [
		'grapes', // en
		'виноград', // ru
	]],
	['🍈', [
		'melon', 'melons', // en
		'дяня', 'дыни' // ru
	]],
	['🍉', [
		'watermelon', 'watermelons', // en
		'арбуз', 'арбузы' // ru
	]],
	['🍊', [
		'tangerine', 'tangerines', // en
		'', '', // ru
	]],
	['🍋', [
		'lemon', 'lemons', // en
		'лемон', 'лемоны', // ru
	]],
	['🍌', [
		'banana', 'bananas', // en
		'банан', 'бананы', // ru
	]],
	['🍍', [
		'pineapple', 'pineapples', // en
		'ананас', 'ананасы', // ru
	]],
	['🥭', [
		'mango', 'mangos', // en
		'манго', // ru
	]],
	['🍎', [
		'apple', 'apples', // en
		'яблоко', 'яблоки', // ru
	]],
	['🍐', [
		'pear', 'pears', // en
		'груша', 'груши', // ru
	]],
	['🍑', [
		'peach', 'peaches', // en
		'персик', 'персики', // ru
	]],
	['🍒', [
		'cherries', 'cherry', // en
		'вишня', 'вишню', // ru
	]],
	['🍓', [
		'strawberry', 'strawberries', // en
		'клубника', 'клубнику', // ru
	]],
	['🥝', [
		'kiwi', 'kiwis', // en
		'киви', // ru
	]],
	['🍅', [
		'tomato', 'tomatos', // en
		'помидора', 'помидуру', 'помидоры' // ru
	]],
	['🥥', [
		'coconut', 'coconuts', // en
		'кокос', 'кокосы', // ru
	]],
	['🥑', [
		'avocado', 'avocados', // en
		'авокадо', // ru
	]],
	['🍆', [
		'eggplant', 'eggplants', // en
		'баклажан', 'баклажаны', // ru
	]],
	['🥔', [
		'potato', 'potatoes', // en
		'картошка', 'картошку', 'картошки' // ru
	]],
	['🥕', [
		'carrot', 'carrot', // en
		'марковка', 'марковку', 'марковки' // ru
	]],
	['🌽', [
		'ear', 'ears', 'corn', 'corns', // en
		'кукуруза', 'кукурузу', 'кукурузы' // ru
	]],
	['🌶', [
		'pepper', 'peppers', // en
		'peper', 'pepers', // en typo
		'перец', 'перца', // ru
	]],
	['🥒', [
		'cucumber', 'cucumbers', // en
		'огурец', 'огурцы', 'огурца' // ru
	]],
	// "🥬" leafs
	['🥦', [
		'broccoli', // en
		'broccolli', // en typo
		'broccolly', // en typo
		'broccoly', // en typo
		'brocoli', // en typo
		'brocoly', // en typo
		'brocolli', // en typo
		'brocolly', // en typo
		'броколли', // ru
	]],
	['🍄', [
		'mushroom', 'mushrooms', // en
		'гриб', 'грибы', // ru
	]],
	['🧂', [
		'salt', 'sodium', // en
		'соль', 'сода', // ru
	]],
	['🥜', [
		'peanut', 'peanuts', // en
		// TODO: '', '', // ru
	]],
	['🌰', [
		'chestnut', 'chestnuts', // en
		'орех', 'орехи', 'орехов' // ru
	]],
	['🍞', [
		'bread', 'breads', // en
		'хлеб', 'хлеба', 'буханку', 'буханки' // ru
	]],
	['🥐', [
		'croissant', 'croissants', // en
		'круасан', 'круасанов', 'круасана' // ru
	]],
	['🥖', [
		'baguette', 'baguettes', // en
		'багет', 'багета', 'багетов', 'батон', 'батона', 'батонов', // ru
	]],
	['🥨', [
		'pretzel', 'pretzels', // en
		'крендель', 'кренделя', // ru
	]],
	['🥞', [
		'pancake', 'pancakes', // en
		'блин', 'блина', 'блинов', 'блины', // ru
	]],
	['🧀', [
		'cheese', 'cheeses', // en
		'сыр', 'сыра', 'сыров' // ru
	]],
	['🚰', [
		'water',
		'вода', 'воды',
	]],
	['🍖', [
		'meat', 'meats', // en
		'мясо', 'мяса', // ru
	]],
	['🍗', [
		'leg', 'legs', // en
		'ножку', 'окорок', // ru
	]],
	['🥩', [
		'beef', 'pork', // en
		'говядина', 'говядины', 'говядину' // ru
	]],
	['🥓', [
		'bacon', // en
		'бекон', 'бекона', // ru
	]],
	['🍔', [
		'hamburger', 'hamburgers', 'cheeseburger', 'cheeseburgers', // en
		'гамбургер', 'гамбургера', 'чизбургер', 'чизбургера', '', // ru
	]],
	['🍟 fries', [
		'fries', 'fries', // en
		'фри', // ru
	]],
	['🍕', [
		'pizza', 'pizzas', // en
		'пицца', 'пиццы', 'пиццу' // ru
	]],
	['🌭', [
		'hot dog', 'hot-dog', // en
		'хот дог', 'хот-дог', 'сосику', 'сосиски' // ru
	]],
	['🥪', [
		'sandwich', 'sandwiches', // en
		'cэндвич', 'cэндвича', 'cэндвичей', 'cендвич', 'cендвича', 'cендвичей',  // ru
	]],
	['🌮', [
		'taco', 'tacos', // en
		'тако', 'такос', // ru
	]],
	['🌯', [
		'burrito', 'burritos', // en
		'бурито', 'буритто', 'буррито', 'бурритто' // ru
	]],
	['🥗', [
		'salad', 'salads', // en
		'салат', 'салата', // ru
	]],
	['🍿', [
		'popcorn', // en
		'попкорн', 'попкорна', // ru
	]],
	['🥫', [
		'canned', 'can', 'cans', // en
		'консерва', 'консервы', 'горошек' // ru
	]],
	['🍱', [
		'bento', // en
		'бенто', // ru
	]],
	['🍤', [
		'shrimp', 'shrimps', // en
		'креветка', 'креветки', 'креветок', // ru
	]],
	['🥟', [
		'dumpling', 'dumplings', // en
		'пельмени', 'пельмень', 'пельменей', // ru
	]],
	['🍦', [
		'ice cream', // en
		'мороженное', 'мороженного', // ru
	]],
	['🍩', [
		'doughnut', 'doughnuts', // en
		'пончик', 'пончика', 'пончики', 'пончиков', // ru
	]],
	['🍪', [
		'cookie', 'cookies', // en
		'печенье', 'печенья', 'печеньев', // ru
	]],
	['🎂', [
		'cake', 'birthday', // en
		'торт', 'торта', 'тортов', // ru
	]],
	['🥧', [
		'pie', 'pies', // en
		'пирог', 'пирога', 'пироги', 'пирогов', // ru
	]],
	['🍫', [
		'chocolate', 'chocolates', // en
		'шоколад', 'шоколадка', 'шоколада', 'шоколадку', 'шоколадок', 'шоколад',  // ru
	]],
	['🍬', [
		'candy', 'candies', // en
		'конфета', 'конфеты', 'конфету', 'конфет', // ru
	]],
	['🍭', [
		'lollipop', 'lollipops', // en
		'лолипоп', 'леденец', 'леденцов', 'леденцы', // ru
	]],
	['🍮', [
		'custard', 'custards', // en
		'кастард', // ru
	]],
	['🍯', [
		'honey', // en
		'мёд', 'мёда', 'мёду', 'мед', 'меда', 'меду', // ru
	]],
	['🥛', [
		'milk', 'kefir', // en
		'молоко', 'молока', 'кефир', 'кефира', // ru
	]],
	['☕', [
		'tea', 'coffee', // en
		'чай', 'чаю', 'кофе', 'кофею', 'cacao', // ru
	]],
	['🍶', [
		'sake', // en
		'саке', // ru
	]],
	['🍾', [
		'champagne', // en
		'шампанское', 'шампанского', // ru
		'bottle',
		'botle',
		'vine', 'вино',
		'vodka', 'водка', 'водки',
		'whisky',
		'brandy',
		'martini',
	]],
	['🍷', [
		'wine', // en
		'вино', 'вина', 'винца', // ru
	]],
	['🍸', [
		'cocktail', 'cocktails', // en
		'коктейль', 'коктэйль', // ru
	]],
	['🍺', [
		'beer', 'beers', // en
		'пиво', 'пива', // ru
	]],
	['🥢', [
		'chopsticks', 'chopstick', // en
		'палочки', 'палочек', // ru
	]],
	['🥄', [
		'spoon', 'spoons', // en
		'ложка', 'ложку', 'ложки', // ru
	]],
	['🍝', [
		'spaghetti', // en
		'спагетти', 'макароны', 'вермишель', // ru
	]],
	['🚬', [
		'cigarette', 'cigarettes', // en
		'сигареты', 'сигару', 'сигары', // ru
	]],
	['💊', [
		'pill', 'pills', // en
		'лекарства', 'лекарств', 'таблетку', 'таблетки', // ru
	]],
	['⚙', [
		'gear', // en
		// TODO: '', // ru
	]],
	['🔧', [
		'wrench', 'tools', // en
		'гаечный', // ru
	]],
	['🔨', [
		'hammer', // en
		'молоток', 'молотки', 'молотоков', // ru
	]],
	['🔑', [
		'key', // en
		'ключ', 'ключи', 'ключей', 'ключа', // ru
	]],
	['🔒', [
		'lock', // en
		'замок', 'замки', 'замков', // ru
	]],
	['✂', [
		'scissors', // en
		'ножницы', 'ножниц', // ru
	]],
	['📏', [
		'ruler', // en
		'линейка', 'линеек', // ru
	]],
	['📎', [
		'paperclip', // en
		'скрепку', 'скрепки', 'скрепок', // ru
	]],
	['📌', [
		'pushpin', // en
		'кнпка', 'кнопки', 'кнопок',  // ru
	]],
	['📅', [
		'calendar', // en
		'календарь', // ru
	]],
	['✏', [
		'pencil', 'pencils', // en
		'карандаш', 'карандаши', 'карандашей', // ru
	]],
	['🖍', [
		'crayon', 'crayons', // en
		'фломастер', 'фламастер', 'фломастеры', 'фламастеры', 'фломастеров', 'фламастеров', // ru
	]],
	['✉', [
		'envelope', 'envelopes', 'stamp', 'stamps', // en
		'конверт', 'конвертов', 'марку', 'марки', 'марок'  // ru
	]],
	['🔦', [
		'flashlight', 'flashlights', // en
		'фонарь', 'фонарик', 'фонарики', // ru
	]],
	['💡', [
		'bulb', 'bulbs', // en
		'лампа', 'лампу', 'лампы', 'ламп', 'лампочка', 'лампочку', 'лампочки', 'лампочек', // ru
	]],
	['🕯', [
		'candle', 'candles', // en
		'свеча', 'свечу', 'свечи', 'свечей', 'свечек', 'свечку', // ru
	]],
	['📀', [
		'dvd', // en
		'двд', 'дивиди', // ru
	]],
	['⌨', [
		'keyboard', // en
		'клавиатуру', 'клавиатры', // ru
	]],
	['🖨', [
		'printer', // en
		'принтер', 'принтеры', 'принтеров', // ru
	]],
	['🖥', [
		'desktop', 'computer', // en
		'компьютер', 'компьютера', 'компьютеров',  // ru
	]],
	['💻', [
		'laptop', // en
		'лэптоп', 'лэптопа', 'ноутбук', 'ноутбука', 'ноутбуков', // ru
	]],
	['🔌', [
		'plug', 'plugs', // en
		'розетка', // ru
	]],
	['🔋', [
		'battery', // en
		'батарея', 'батарейка', 'батарею', 'батарей', 'батарейку', 'аккамулятор', 'аккамулятора', 'аккамуляторов',  // ru
	]],
	['📠', [
		'fax', // en
		'факс', // ru
	]],
	['📻', [
		'radio', // en
		'радио', // ru
	]],
	['🎁', [
		'gift', 'gifts', // en
		'подарок', 'подарки', 'подарков', // ru
	]],
	['🎈', [
		'balloon', 'balloons', // en
		'шар', 'шары', 'шарик', 'шарики', 'шаров', 'шариков', // ru
	]],
	['🌡', [
		'thermometer', 'thermometers', // en
		'термометр', 'термометры', 'термометров', 'термометра',  // ru
	]],
	['🛢', [
		'oil', // en
		'масло', // ru
	]],
	['💈', [
		'barber', // en
		'барбер', 'парикмахер', 'парикмахеру', 'парикмахерcкая',  // ru
	]],
	['🗺', [
		'map', // en
		'карта', 'карту', // ru
	]],
	['🔪', [
		'knife', 'knifes', // en
		'нож', 'ножа', 'ножи', 'ножей', // ru
	]],
	['🛌', [
		'bed', // en
		'кровать', 'кровати', 'кроватей', 'матрас', // ru
	]],
	['🛀', [
		'bath', // en
		'ванна', 'ванной', // ru
	]],
	['🎞', [
		'film', 'movie', // en
		'плёнка', 'кино', 'мультик', // ru
	]],
	['📺', [
		'TV', // en
		'тв', 'телевизор', 'телевизора', 'телевизоров', // ru
	]],
	['🏷', [
		'label', 'label', // en
		'ярлык', 'ярлыки', 'ярлыков', 'ярлычок', 'ярлычки',  // ru
	]],
	['🚕', [
		'taxi', // en
		'такси', // ru
	]],
	['🚗', [
		'automobile', 'car', // en
		'машина', 'машины', 'машину', 'авто', 'автомобиль', 'автомобиля', 'автомобилей', 'автомобильный',   // ru
	]],
	['🚚', [
		'truck', 'delivery', // en
		'грузовик', 'доставка', // ru
	]],
	['🚇', [
		'metro', // en
		'метро', 'подземка', // ru
	]],
	['🚊', [
		'tram', // en
		'трамвай', 'трамваи', 'трамвая', 'трамвайный', // ru
	]],
];

const emojiByKeyword: { [kw: string]: string } = {};
emojiKeywords
	.filter(item => item[0] && item[1] && item[1].length)
	.forEach(
		item => {
			item[1]
				.filter(kw => !!kw)
				.forEach(
					kw => {
						emojiByKeyword[kw] = item[0];
					}
				);
		},
	);

export function detectEmoji(s?: string): string | undefined {
	if (s) {
		const words = s.toLowerCase()
			.split(' ');
		for (const word of words) {
			const emoji = emojiByKeyword[word];
			if (emoji) {
				return emoji;
			}
		}
	}
	return undefined;
}
